stichiry_HospodyVozvach = [
  "Ἐξάγαγε ἐκ φυλακῆς τὴν ψυχήν μου, τοῦ ἐξομολογήσασθαι τῷ ὀνόματί σου.",
  "Ἐμὲ ὑπομενοῦσι δίκαιοι, ἕως οὐ ἀνταποδῷς μοι.",
  "Ἐκ βαθέων ἐκέκραξά σοι, Κύριε, Κύριε εἰσάκουσον τῆς φωνῆς μου.",
  "Γενηθήτω τὰ ὦτά σου προσέχοντα εἰς τὴν φωνὴν τῆς δεήσεώς μου.",
  "Ἐὰν ἀνομίας παρατηρήσῃς, Κύριε, Κύριε τίς ὑποστήσεται; ὅτι παρὰ σοὶ ὁ ἱλασμός ἐστιν.",
  "Ἕνεκεν τοῦ ὀνόματός σου ὑπέμεινά σε, Κύριε, ὑπέμεινεν ἡ ψυχή μου εἰς τὸν λόγον σου, ἤλπισεν ἡ ψυχή μου ἐπὶ τὸν Κύριον.",
  "Ἀπὸ φυλακῆς πρωΐας μέχρι νυκτός, ἀπὸ φυλακῆς πρωΐας ἐλπισάτω Ἰσραὴλ ἐπὶ τὸν Κύριον.",
  "Ὅτι παρὰ τῷ Κυρίῳ τὸ ἔλεος, καὶ πολλὴ παρ' αὐτῷ, λύτρωσις καὶ αὐτὸς λυτρώσεται τὸν Ἰσραὴλ ἐκ πασῶν τῶν ἀνομιῶν αὐτοῦ.",
  "Αἰνεῖτε τὸν Κύριον πάντα τὰ ἔθνη, ἐπαινέσατε αὐτόν, πάντες οἱ λαοί.",
  "Ὅτι ἐκραταιώθη τὸ ἔλεος αὐτοῦ ἐφ' ἡμᾶς, καὶ ἡ ἀλήθεια τοῦ Κυρίου μένει εἰς τὸν αἰῶνα.",
]

stichiry_Stichovni = {
  "M": (
    {"TEXT": "Μνησθήσομαι τοῦ ὀνόματός σου ἐν πάσῃ γενεᾷ καὶ γενεᾷ."},
    {"TEXT": "Ἄκουσον, θύγατερ, καὶ ἴδε, καὶ κλῖνον τὸ οὖς σου, καὶ ἐπιλάθου τοῦ λαοῦ σου καὶ τοῦ οἴκου τοῦ Πατρός σου."},
    {"TEXT": "Τὸ πρόσωπόν σου λιτανεύσουσιν οἱ πλούσιοι τοῦ λαοῦ."},
  ),
  "0": (
    {"TEXT": "Ὁ Κύριος ἐβασίλευσεν, εὐπρέπειαν ἐνεδύσατο. Ἐνεδύσατο ὁ Κύριος δύναμιν καὶ περιεζώσατο."},
    {"TEXT": "Καὶ γὰρ ἐστερέωσεν τὴν οἰκουμένην, ἥτις οὐ σαλευθήσεται."},
    {"TEXT": "Τῷ οἴκῳ σου πρέπει ἁγίασμα Κύριε εἰς μακρότητα ἡμερῶν."},
  ),
  "6": (
    {"TEXT": "Θαυμαστὸς ὁ Θεὸς ἐν τοῖς ἁγίοις αὐτοῦ, ὁ Θεὸς Ἰσραὴλ αὐτὸς δώσει δύναμιν καὶ κραταίωσιν τῷ λαῷ αὐτοῦ εὐλογητὸς ὁ Θεός."},
    {"TEXT": "Τοῖς Ἁγίοις τοῖς ἐν τῇ γῇ αὐτοῦ ἐθαυμάστωσεν ὁ Κύριος πάντα τὰ θελήματα αὐτοῦ ἐν αὐτοῖς."},
    {"TEXT": "Μακάριοι οὓς ἐξελέξω καὶ προσελάβου Κύριε."},
  ),
  "x": (
    {"TEXT": "Πρὸς σὲ ᾖρα τοὺς ὀφθαλμούς μου, τὸν κατοικοῦντα ἐν τῷ οὐρανῷ. Ἰδού, ὡς ὀφθαλμοὶ δούλων εἰς χεῖρας τῶν κυρίων αὐτῶν, ὡς ὀφθαλμοὶ παιδίσκης εἰς χεῖρας τῆς κυρίας αὐτῆς, οὕτως οἱ ὀφθαλμοὶ ἡμῶν πρὸς Κύριον τὸν Θεὸν ἡμῶν, ἕως οὗ οἰκτειρῆσαι ἡμᾶς."},
    {"TEXT": "Ἐλέησον ἡμᾶς, Κύριε, ἐλέησον ἡμᾶς, ὅτι ἐπὶ πολὺ ἐπλήσθημεν ἐξουδενώσεως, ἐπὶ πλεῖον ἐπλήσθη ἡ ψυχὴ ἡμῶν, τὸ ὄνειδος τοῖς εὐθηνοῦσι, καὶ ἡ ἐξουδένωσις τοῖς ὑπερηφάνοις."},
  )
}

stichiry_Chvalite = [ # TODO: wrong order H2/6
  "Τοῦ ποιῆσαι ἐν αὐτοῖς κρῖμα ἔγγραπτον. Δόξα αὕτη ἔσται πᾶσι τοῖς ὁσίοις αὐτοῦ.",
  "Αἰνεῖτε τὸν Θεὸν ἐν τοῖς Ἁγίοις αὐτοῦ, αἰνεῖτε αὐτὸν ἐν στερεώματι τῆς δυνάμεως αὐτοῦ.",
  "Αἰνεῖτε αὐτὸν ἐπὶ ταῖς δυναστείαις αὐτοῦ, αἰνεῖτε αὐτὸν κατὰ τὸ πλῆθος τῆς μεγαλωσύνης αὐτοῦ.",
  "Αἰνεῖτε αὐτὸν ἐν ἤχῳ, σάλπιγγος, αἰνεῖτε αὐτὸν ἐν ψαλτηρίῳ καὶ κιθάρᾳ.",
  "Αἰνεῖτε αὐτὸν ἐν τυμπάνῳ καὶ χορῷ, αἰνεῖτε αὐτὸν ἐν χορδαῖς καὶ ὀργάνῳ,",
  "Αἰνεῖτε αὐτὸν ἐν κυμβάλοις εὐήχοις, αἰνεῖτε αὐτὸν ἐν κυμβάλοις ἀλαλαγμοῦ. Πᾶσα πνοὴ αἰνεσάτω τὸν Κύριον.",
  "Ἀνάστηθι, Κύριε, ὁ Θεός μου, ὑψωθήτω ἡ χείρ σου, μὴ ἐπιλάθῃ τῶν πενήτων σου εἰς τέλος.",
  "Ἐξομολογήσομαί σοι, Κύριε, ἐν ὅλῃ καρδίᾳ μου, διηγήσομαι πάντα τὰ θαυμάσιά σου.",
]

stichiry_Stichovni_Utrena = {
  "x": (
    "Ἐνεπλήσθημεν τὸ πρωῒ τοῦ ἐλέους σου, Κύριε, καὶ ἠγαλλιασάμεθα καὶ ηὐφράνθημεν ἐν πάσαις ταῖς ἡμέραις ἡμῶν. Εὐφρανθείημεν, ἀνθ΄ὧν ἡμερῶν ἐταπείνωσας ἡμᾶς, ἐτῶν, ὧν εἴδομεν κακά, καὶ ἴδε ἐπὶ τοὺς δούλους σου καὶ ἐπὶ τὰ ἔργα σου, καὶ ὁδήγησον τοὺς υἱοὺς αὐτῶν.",
    "Καὶ ἔστω ἡ λαμπρότης Κυρίου τοῦ Θεοῦ ἡμῶν ἐφ' ἡμᾶς, καὶ τὰ ἔργα τῶν χειρῶν ἡμῶν κατεύθυνον ἐφ' ἡμᾶς, καὶ τὸ ἔργον τῶν χειρῶν ἡμῶν κατεύθυνον.",
  ),
  "6": (
    "Μακάριοι οὓς ἐξελέξω καὶ προσελάβου Κύριε.",
    "Αἱ ψυχαὶ αὐτῶν ἐν ἀγαθοῖς αὐλισθήσονται.",
    "Καὶ τὸ μνημόσυνον αὐτῶν εἰς γενεὰν καὶ γενεάν.",
  )
}

stichiry_Blazenny = ( #TODO
  "Blažéni níščiji Dúchom, jáko ťích jésť cárstvo nebésnoje.",
  "Blažéni pláčuščiji, jáko tíji uťíšatsja.",
  "Blažéni krótcyji, jáko tíji nasľíďat zémľu.",
  "Blaženi alčuščiji i žažduščiji pravdy, jako tiji nasyťatsja.",
  "Μακάριοι οἱ ἐλεήμονες, ὅτι αὐτοὶ ἐλεηθήσονται.",
  "Μακάριοι οἱ καθαροὶ τῇ καρδίᾳ ὅτι αὐτοὶ τὸν Θεὸν ὄψονται.",
  "Μακάριοι οἱ εἰρηνοποιοί, ὅτι αὐτοὶ υἱοὶ Θεοῦ κληθήσονται.",
  "Μακάριοι οἱ δεδιωγμένοι ἕνεκεν δικαιοσύνης, ὅτι αὐτῶν ἐστιν ἡ βασιλεία τῶν οὐρανῶν.",
  "Μακάριοί ἐστε ὅταν ὀνειδίσωσιν ὑμᾶς, καὶ διώξωσι, καὶ εἴπωσι πᾶν πονηρὸν ῥῆμα καθ΄ὑμῶν ψευδόμενοι ἕνεκεν ἐμοῦ.",
  "Χαίρετε καὶ ἀγαλλιᾶσθε, ὅτι ὁ μισθὸς ὑμῶν πολὺς ἐν τοῖς οὐρανοῖς.",
)

pripivy = { #TODO
  "0": (
    ("Δόξα τή Αγία Αναστάσει σου, Κύριε."),
    ("Δόξα σοι ο Θεός ημών δόξα σοι."), 
    ("Υπεραγία Θεοτόκε, σώσον ημάς.") 
  )
}

pripiv_P = "Υπεραγία Θεοτόκε, σώσον ημάς." # TODO
pripiv_N = "Ἁγία Τριάς, ὁ Θεός, ἐλέησον καὶ σῶσον ἡμᾶς." # TODO

kanony = { #TODO
  "0": (
    "Κανὼν Ἀναστάσιμος",
    "Κανὼν Σταυροαναστάσιμος",
    "Κανὼν τῆς Θεοτόκου"
  ),
  "1": (
    "Κανὼν Κατανυκτικὸς ποίημα Ἰωσήφ",
    "Κανὼν τῶν Ἀσωμάτων"
  ),
  "2": (
    "Κανών Κατανυκτικός",
    "Κανών τού Προδρόμου"
  ),
  "3": (
    "Κανών Σταυρώσιμος",
    "Κανὼν τῆς Θεοτόκου"
  ),
  "4": (
    "Κανὼν τῶν ἁγίων Ἀποστόλων",
    "Κανὼν τοῦ Ἁγίου Νικολάου"
  ),
  "5": (
    "Κανών Σταυρώσιμος",
    "Κανὼν τῆς Θεοτόκου"
  ),
  "6": (
    "Κανών εις Προφήτας καί Μάρτυρας",
    "Κανών Νεκρώσιμος"
  )
}