stichiry_HospodyVozvach = [
  "И҆зведѝ и҆з̾ темни́цы дꙋ́шꙋ мою̀, и҆сповѣ́датисѧ и҆́мени твоемꙋ̀.",
  "Менѐ ждꙋ́тъ пра́вєдницы, до́ндеже возда́си мнѣ̀.",
  "И҆з̾ глꙋбины̀ воззва́хъ къ тебѣ̀ гдⷭ҇и, гдⷭ҇и, ᲂу҆слы́ши гла́съ мо́й.",
  "Да бꙋ́дꙋтъ ᲂу҆́ши твоѝ, вне́млющѣ гла́сꙋ моле́нїѧ моегѡ̀.",
  "А҆́ще беззакѡ́нїѧ на́зриши гдⷭ҇и, гдⷭ҇и, кто̀ постои́тъ; ꙗ҆́кѡ ᲂу҆ тебѐ ѡ҆чище́нїе є҆́сть.",
  "И҆́мене ра́ди твоегѡ̀ потерпѣ́хъ тѧ̀ гдⷭ҇и, потерпѣ̀ дꙋша̀ моѧ̀ въ сло́во твоѐ, ᲂу҆пова̀ дꙋша̀ моѧ̀ на гдⷭ҇а.",
  "Ѿ стра́жи ᲂу҆́треннїѧ до но́щи, ѿ стра́жи ᲂу҆́треннїѧ, да ᲂу҆пова́етъ і҆и҃ль на гдⷭ҇а.",
  "Ꙗ҆́кѡ ᲂу҆ гдⷭ҇а млⷭ҇ть, и҆ мно́гое ᲂу҆ негѡ̀ и҆збавле́нїе, и҆ то́й и҆зба́витъ і҆и҃лѧ ѿ всѣ́хъ беззако́нїй є҆гѡ̀.",
  "Хвали́те гдⷭ҇а всѝ ꙗ҆зы́цы, похвали́те є҆го̀ всѝ лю́дїе.",
  "Ꙗ҆́кѡ ᲂу҆тверди́сѧ млⷭ҇ть є҆гѡ̀ на на́съ, и҆ и҆́стина гдⷭ҇нѧ пребыва́етъ во вѣ́къ."
  ]

stichiry_Stichovni = {
  "M": (
    {"TEXT": "Помѧнꙋ̀ и҆́мѧ твоѐ во всѧ́комъ ро́дѣ и҆ ро́дѣ."},
    {"TEXT": "Слы́ши дщѝ и҆ ви́ждь, и҆ приклонѝ ᲂу҆́хо твоѐ."},
    {"TEXT": "Лицꙋ̀ твоемꙋ̀ помо́лѧтсѧ бога́тїи лю́дстїи."},
  ),
  "0": (
    {"TEXT": "Гдⷭ҇ь воцари́сѧ, въ лѣ́потꙋ ѡ҆блече́сѧ."},
    {"TEXT": "И҆́бо ᲂу҆твердѝ вселе́ннꙋю, ꙗ҆́же не подви́житсѧ."},
    {"TEXT": "До́мꙋ твоемꙋ̀ подоба́етъ ст҃ы́нѧ гдⷭ҇и, въ долготꙋ̀ дні́й."},
  ),
  "6": (
    {"TEXT": "Бл҃же́ни, ꙗ҆̀же и҆збра́лъ и҆ прїѧ́лъ є҆сѝ гдⷭ҇и."},
    {"TEXT": "Дꙋ́шы и҆́хъ во бл҃ги́хъ водворѧ́тсѧ."},
    {"TEXT": ""},
  ),
  "x": (
    {"TEXT": "Къ тебѣ̀ возведо́хъ ѻ҆́чи моѝ, живꙋ́щемꙋ на нб҃сѝ. сѐ ꙗ҆́кѡ ѻ҆́чи ра̑бъ въ рꙋкꙋ̀ госпо́дїй свои́хъ, ꙗ҆́кѡ ѻ҆́чи рабы́ни въ рꙋкꙋ̀ госпожѝ своеѧ̀: та́кѡ ѻ҆́чи на́ши ко гдⷭ҇ꙋ бг҃ꙋ на́шемꙋ, до́ндеже ᲂу҆ще́дритъ ны̀."},
    {"TEXT": "Поми́лꙋй на́съ, гдⷭ҇и, поми́лꙋй на́съ, ꙗ҆́кѡ по мно́гꙋ и҆спо́лнихомсѧ ᲂу҆ничиже́нїѧ: наипа́че напо́лнисѧ дꙋша̀ на́ша поноше́нїѧ гобзꙋ́ющихъ, и҆ ᲂу҆ничиже́нїѧ го́рдыхъ."},
  )
}

stichiry_Chvalite = [
  "Сотвори́ти въ ни́хъ сꙋ́дъ напи́санъ: сла́ва сїѧ̀ бꙋ́детъ всѣ̑мъ прпⷣбнымъ є҆гѡ̀.",
  "Хвали́те бг҃а во ст҃ы́хъ є҆гѡ̀, хвали́те є҆го̀ во ᲂу҆тверже́нїи си́лы є҆гѡ̀.",
  "Хвали́те є҆го̀ на си́лахъ є҆гѡ̀, хвали́те є҆го̀ по мно́жествꙋ вели́чествїѧ є҆гѡ̀.",
  "Хвали́те є҆го̀ во гла́сѣ трꙋ́бнѣмъ: хвали́те є҆го̀ во ѱалти́ри и҆ гꙋ́слехъ.",
  "Хвали́те є҆го̀ въ тѷмпа́нѣ и҆ ли́цѣ, хвали́те є҆го̀ во стрꙋ́нахъ и҆ ѻ҆рга́нѣ.",
  "Хвали́те є҆го̀ въ кѷмва́лѣхъ доброгла́сныхъ, хвали́те є҆го̀ въ кѷмва́лѣхъ восклица́нїѧ: всѧ́кое дыха́нїе да хва́литъ гдⷭ҇а.",
  "Воскрⷭ҇нѝ гдⷭ҇и бж҃е мо́й, да вознесе́тсѧ рꙋка̀ твоѧ̀, не забꙋ́ди ᲂу҆бо́гихъ твои́хъ до конца̀.",
  "И҆сповѣ́мсѧ тебѣ̀ гдⷭ҇и всѣ́мъ се́рдцемъ мои́мъ, повѣ́мъ всѧ̑ чꙋдеса̀ твоѧ̑.",
]

stichiry_Stichovni_Utrena = {
  "x": (
    "И҆спо́лнихомсѧ заꙋ́тра млⷭ҇ти твоеѧ̀ гдⷭ҇и, и҆ возра́довахомсѧ и҆ возвесели́хомсѧ, во всѧ̑ дни̑ на́шѧ возвесели́хомсѧ, за дни̑, въ нѧ́же смири́лъ ны̀ є҆сѝ, лѣ̑та, въ нѧ́же ви́дѣхомъ ѕла̑ѧ: и҆ при́зри на рабы̑ твоѧ̑, и҆ на дѣла̀ твоѧ̑, и҆ наста́ви сы́ны и҆́хъ.",
    "И҆ бꙋ́ди свѣ́тлость гдⷭ҇а бг҃а на́шегѡ на на́съ, и҆ дѣла̀ рꙋ́къ на́шихъ и҆спра́ви на на́съ, и҆ дѣ́ло рꙋ́къ на́шихъ и҆спра́ви.",
  ),
  "6": (
    "Бл҃же́ни, ꙗ҆̀же и҆збра́лъ и҆ прїѧ́лъ є҆сѝ гдⷭ҇и.",
    "Дꙋ́шы и҆́хъ во бл҃ги́хъ водворѧ́тсѧ.",
    "И҆ па́мѧть и҆́хъ въ ро́дъ и҆ ро́дъ.",
  )
}

stichiry_Blazenny = (
  "Бл҃же́ни ни́щїи дх҃омъ, ꙗ҆́кѡ тѣ́хъ є҆́сть црⷭ҇тво нбⷭ҇ное.",
  "Бл҃же́ни пла́чꙋщїи, ꙗ҆́кѡ ті́и ᲂу҆тѣ́шатсѧ.",
  "Бл҃же́ни кро́тцыи, ꙗ҆́кѡ ті́и наслѣ́дѧтъ зе́млю.",
  "Бл҃же́ни а҆́лчꙋщїи и҆ жа́ждꙋщїи пра́вды, ꙗ҆́кѡ ті́и насы́тѧтсѧ.",
  "Бл҃же́ни млⷭ҇тивїи, ꙗ҆́кѡ ті́и поми́ловани бꙋ́дꙋтъ.",
  "Бл҃же́ни чи́стїи се́рдцемъ, ꙗ҆́кѡ ті́и бг҃а ᲂу҆́зрѧтъ.",
  "Бл҃же́ни миротво́рцы, ꙗ҆́кѡ ті́и сн҃ове бж҃їи нарекꙋ́тсѧ.",
  "Бл҃же́ни и҆згна́ни пра́вды ра́ди, ꙗ҆́кѡ тѣ́хъ є҆́сть црⷭ҇тво нбⷭ҇ное.",
  "Бл҃же́ни є҆стѐ, є҆гда̀ поно́сѧтъ ва́мъ, и҆ и҆жденꙋ́тъ, и҆ рекꙋ́тъ всѧ́къ ѕо́лъ глаго́лъ на вы̀ лжꙋ́ще менѐ ра́ди.",
  "Ра́дꙋйтесѧ и҆ весели́тесѧ, ꙗ҆́кѡ мзда̀ ва́ша мно́га на нб҃сѣ́хъ.",
)

pripivy = {
  "0": (
    ("Сла́ва гдⷭ҇и ст҃о́мꙋ воскрⷭ҇нїю твоемꙋ̀."),
    ("Сла́ва гдⷭ҇и крⷭ҇тꙋ̀ твоемꙋ̀ и҆ воскрⷭ҇нїю."),
    ("Прест҃а́ѧ Бцⷣе, сп҃сѝ на́съ.")
  )
}

pripiv_P = "Прест҃а́ѧ бцⷣе сп҃сѝ на́съ."
pripiv_N = "Прест҃а́ѧ трⷪ҇це бж҃е на́шъ, сла́ва тебѣ̀."

kanony = {
  "0": (
    "Канѡ́нъ воскрⷭ҇нъ",
    "Канѡ́нъ крⷭ҇товоскре́сенъ",
    "Канѡ́нъ прест҃ѣ́й бцⷣѣ,"
  ),
  "1": (
    "Канѡ́нъ ᲂу҆мили́тельный",
    "Канѡ́нъ безплѡ́тнымъ"
  ),
  "2": (
    "Канѡ́нъ покаѧ́ненъ",
    "Канѡ́нъ ст҃о́мꙋ вели́комꙋ прⷪ҇ро́кꙋ і҆ѡа́ннꙋ предте́чи"
  ),
  "3": (
    "Канѡ́нъ чⷭ҇тно́мꙋ и҆ животворѧ́щемꙋ крⷭ҇тꙋ̀",
    "Канѡ́нъ прест҃ѣ́й бцⷣѣ,"
  ),
  "4": (
    "Канѡ́нъ ст҃ы́мъ а҆пⷭ҇лѡмъ",
    "Канѡ́нъ нїкола́ю чꙋдотво́рцꙋ"
  ),
  "5": (
    "Канѡ́нъ чⷭ҇тно́мꙋ и҆ животворѧ́щемꙋ крⷭ҇тꙋ̀",
    "Канѡ́нъ прест҃ѣ́й бцⷣѣ,"
  ),
  "6": (
    "Канѡ́нъ ст҃ы̑мъ мч҃нкѡмъ, и҆ ст҃и́телємъ, и҆ прпⷣбнымъ и҆ ᲂу҆со́пшымъ",
    "Канѡ́нъ ᲂу҆со́пшымъ"
  )
}